[
  {
    "title": "HTML",
    "description": "Hypertext Markup Language (HTML) is the standard markup language for creating web pages and web applications. With Cascading Style Sheets (CSS) and JavaScript, it forms a triad of cornerstone technologies for the World Wide Web.",
    "relatedSkills": [],
    "type": "technology",
    "officialSite": "https://www.w3.org/html/"
  },
  {
    "title": "CSS",
    "description": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language like HTML. CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",
    "relatedSkills": [],
    "type": "technology",
    "officialSite": "https://www.w3.org/Style/CSS/"
  },
  {
    "title": "JavaScript",
    "description": "JavaScript, often abbreviated as JS, is a high-level, interpreted programming language. It is a language which is also characterized as dynamic, weakly typed, prototype-based and multi-paradigm. Alongside HTML and CSS, JavaScript is one of the three core technologies of the World Wide Web.",
    "relatedSkills": [],
    "type": "technology",
    "officialSite": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
  },
  {
    "title": "Haml",
    "description": "Haml (HTML Abstraction Markup Language) is a templating system that is designed to avoid writing inline code in a web document and make the HTML cleaner. Haml gives the flexibility to have some dynamic content in HTML.",
    "relatedSkills": [
      "HTML"
    ],
    "type": "technology",
    "officialSite": "http://haml.info/"
  },
  {
    "title": "Pug",
    "description": "Pug is a breed of dog with physically distinctive features of a wrinkly, short-muzzled face, and curled tail. The breed has a fine, glossy coat that comes in a variety of colours, most often fawn or black, and a compact square body with well-developed muscles.",
    "relatedSkills": [
      "HTML"
    ],
    "type": "technology",
    "officialSite": "https://pugjs.org/api/getting-started.html"
  },
  {
    "title": "Handlebars.js",
    "description": "Handlebars.js is a popular templating engine that is powerful, simple to use and has a large community. It is based on the Mustache template language, but improves it in several important ways. With Handlebars, you can separate the generation of HTML from the rest of your JavaScript and write cleaner code.",
    "relatedSkills": [
      "HTML"
    ],
    "type": "technology",
    "officialSite": "http://handlebarsjs.com/"
  },
  {
    "title": "Sass",
    "description": "Sass (Syntactically awesome style sheets) is a style sheet language initially designed by Hampton Catlin and developed by Natalie Weizenbaum. After its initial versions, Weizenbaum and Chris Eppstein have continued to extend Sass with SassScript, a simple scripting language used in Sass files.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "https://sass-lang.com/"
  },
  {
    "title": "Less",
    "description": "Less (Leaner Style Sheets; sometimes stylized as LESS) is a dynamic preprocessor style sheet language that can be compiled into Cascading Style Sheets (CSS) and run on the client side or server side. Less is open source.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "http://lesscss.org/"
  },
  {
    "title": "Stylus",
    "description": "Stylus is a revolutionary new language, providing an efficient, dynamic, and expressive way to generate CSS. Supporting both an indented syntax and regular CSS style.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "http://stylus-lang.com/"
  },
  {
    "title": "PostCSS",
    "description": "PostCSS is a software development tool that uses JavaScript-based plugins to automate routine CSS operations. The tool has been used to develop the code of Wikipedia, Facebook, and GitHub. PostCSS is a top-favored CSS tool among npm users.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "https://postcss.org/"
  },
  {
    "title": "Bootstrap",
    "description": "Bootstrap is a free and open-source front-end framework for designing websites and web applications. It contains HTML- and CSS-based design templates for typography, forms, buttons, navigation and other interface components, as well as optional JavaScript extensions.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "https://getbootstrap.com/"
  },
  {
    "title": "Materialize",
    "description": "Materialize is an open source responsive front-end framework that offers slick material design out-of-the-box. This tool is based on Google’s Material Design Language. It is primarily a UX framework that dictates how elements will appear and behave on the page. ",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "https://materializecss.com/"
  },
  {
    "title": "Semantic UI",
    "description": "Semantic UI framework is a front-end development framework that is used to design beautiful and responsive layouts using Hyper-Text Markup Language with a lot of themes.",
    "relatedSkills": [
      "CSS"
    ],
    "type": "technology",
    "officialSite": "https://semantic-ui.com/"
  },
  {
    "title": "TypeScript",
    "description": "TypeScript is an open-source programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript, and adds optional static typing to the language. TypeScript is designed for development of large applications and transcompiles to JavaScript.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://www.typescriptlang.org/"
  },
  {
    "title": "Flow",
    "description": "Flow is a static type checker for your JavaScript code. It is developed at Facebook and is often used with React. It lets you annotate the variables, functions, and React components with a special type syntax, and catch mistakes early.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://flow.org/"
  },
  {
    "title": "jQuery",
    "description": "Query is a JavaScript library designed to simplify the client-side scripting of HTML. It is free, open-source software using the permissive MIT License. Web analysis indicates that it is the most widely deployed JavaScript library by a large margin.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://jquery.com/"
  },
  {
    "title": "Angular",
    "description": "Angular (commonly referred to as 'Angular 2+' or 'Angular v2 and above') is a TypeScript-based open-source front-end web application platform led by the Angular Team at Google and by a community of individuals and corporations. Angular is a complete rewrite from the same team that built AngularJS.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://angular.io/"
  },
  {
    "title": "React",
    "description": "React (also known as React.js or ReactJS) is a JavaScript library for building user interfaces. It is maintained by Facebook and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://reactjs.org/"
  },
  {
    "title": "Vue.js",
    "description": "Vue.js (commonly referred to as Vue) is an open-source JavaScript framework for building user interfaces. Integration into projects that use other JavaScript libraries is simplified with Vue because it is designed to be incrementally adoptable.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://vuejs.org/"
  },
  {
    "title": "Ember.js",
    "description": "Ember.js is an open-source JavaScript web framework, based on the Model–view–viewmodel (MVVM) pattern. It allows developers to create scalable single-page web applications by incorporating common idioms and best practices into the framework.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://www.emberjs.com/"
  },
  {
    "title": "npm",
    "description": "npm (Node.js Package Manager)  s a package manager for the JavaScript programming language. It is the default package manager for the JavaScript runtime environment Node.js. It consists of a command line client, also called npm, and an online database of public and paid-for private packages, called the npm registry.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://www.npmjs.com/"
  },
  {
    "title": "Yarn",
    "description": "Yarn is a package manager for your code. It allows you to use and share code with other developers from around the world. Yarn does this quickly, securely, and reliably so you don’t ever have to worry.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://yarnpkg.com/lang/en/"
  },
  {
    "title": "Gulp",
    "description": "Gulp is a javascript task runner that lets you automate tasks such as: bundling and minifying libraries and stylesheets; refreshing your browser when you save a file; quickly running unit tests; running code analysis Less/Sass to CSS compilation; copying modified files to an output directory.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://gulpjs.com/"
  },
  {
    "title": "Grunt",
    "description": "Grunt is a JavaScript task runner, a tool used to automatically perform frequent tasks such as minification, compilation, unit testing, and linting. It uses a command-line interface to run custom tasks defined in a file (known as a Gruntfile). Grunt was created by Ben Alman and is written in Node.js.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://gruntjs.com/"
  },
  {
    "title": "Webpack",
    "description": "Webpack is an open-source JavaScript module bundler. Its main purpose is to bundle JavaScript files for usage in a browser, yet it is also capable of transforming, bundling, or packaging just about any resource or asset. Webpack takes modules with dependencies and generates static assets representing those modules.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://webpack.js.org/"
  },
  {
    "title": "Rollup",
    "description": "Rollup is a module bundler for JavaScript which compiles small pieces of code into something larger and more complex, such as a library or application. ",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://rollupjs.org/guide/en"
  },
  {
    "title": "Browserify",
    "description": "Browserify is an open-source JavaScript tool that allows developers to write Node.js-style modules that compile for use in the browser. Browserify lets you use require in the browser, the same way you'd use it in Node. It's not just syntactic sugar for loading scripts on the client.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "http://browserify.org/"
  },
  {
    "title": "Jest",
    "description": "Jest is a library for testing JavaScript code. It's an open source project maintained by Facebook, and it's especially well suited for React code testing, although not limited to that: it can test any JavaScript code. Jest is very fast and easy to use.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://jestjs.io/"
  },
  {
    "title": "Mocha",
    "description": "Mocha is a JavaScript test framework for Node.js programs, featuring browser support, asynchronous testing, test coverage reports, and use of any assertion library.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://mochajs.org/"
  },
  {
    "title": "Jasmine",
    "description": "Jasmine is an open source testing framework for JavaScript. It aims to run on any JavaScript-enabled platform, to not intrude on the application nor the IDE, and to have easy-to-read syntax. It is heavily influenced by other unit testing frameworks, such as ScrewUnit, JSSpec, JSpec, and RSpec.",
    "relatedSkills": [
      "JavaScript"
    ],
    "type": "technology",
    "officialSite": "https://jasmine.github.io/"
  },
  {
    "title": "English",
    "description": "English is a West Germanic language that was first spoken in early medieval England and is now a global lingua franca. Named after the Angles, one of the Germanic tribes that migrated to the area of Britain that would later take their name, England, both names ultimately deriving from the Anglia peninsula in the Baltic Sea.",
    "relatedSkills": [
      "Personnel management",
      "SEO"
    ],
    "type": "soft-skills"
  },
  {
    "title": "Database",
    "description": "A database is an organized collection of data, generally stored and accessed electronically from a computer system. Where databases are more complex they are often developed using formal design and modeling techniques.",
    "relatedSkills": [],
    "type": "soft-skills"
  },
  {
    "title": "Personnel management",
    "description": "Human resource management (HRM or HR) is the strategic approach to the effective management of organization workers so that they help the business gain a competitive advantage, Commonly known as the HR Department, it is designed to maximize employee performance in service of an employer's strategic objectives.",
    "relatedSkills": [
      "English"
    ],
    "type": "soft-skills"
  },
  {
    "title": "Graphic design",
    "description": "Graphic symbols are often functionalist and anonymous, as these pictographs from the US National Park Service illustrate. Graphic design is the process of visual communication and problem-solving through the use of typography, photography and illustration. The field is considered a subset of visual communication and communication design, but sometimes the term 'graphic design' is used synonymously.",
    "relatedSkills": [],
    "type": "soft-skills"
  },
  {
    "title": "SEO",
    "description": "Search engine optimization (SEO) is the process of affecting the online visibility of a website or a web page in a web search engine's unpaid results—often referred to as 'natural', 'organic', or 'earned' results.",
    "relatedSkills": [
      "English"
    ],
    "type": "soft-skills"
  }
]
