[{"title":"HTML","description":"HTML — стандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML. Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.","relatedSkills":[],"type":"technology","link":"https://www.w3.org/html/"},{"title":"CSS","description":"CSS — формальный язык описания внешнего вида документа, написанного с использованием языка разметки. Преимущественно используется как средство описания, оформления внешнего вида веб-страниц, написанных с помощью языков разметки HTML и XHTML, но может также применяться к любым XML-документам, например, к SVG или XUL.","relatedSkills":[],"type":"technology","link":"https://www.w3.org/Style/CSS/"},{"title":"JavaScript","description":"JavaScript — мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией языка ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений.","relatedSkills":[],"type":"technology","link":"https://developer.mozilla.org/en-US/docs/Web/JavaScript"},{"title":"Haml","description":"Haml — язык разметки для упрощённой генерации HTML. HAML компилируется в HTML. Эквивалент Haml для CSS — это LESS или Sass.","relatedSkills":["HTML"],"type":"technology","link":"http://haml.info/"},{"title":"Pug","description":"Pug - это препроцессор HTML и шаблонизатор, который был написан на JavaScript для Node.js. Pug имеет некоторые полезные функции, позволяющие писать модульный многоразовый (с возможностью многоразового использования) код.","relatedSkills":["HTML"],"type":"technology","link":"https://pugjs.org/api/getting-started.html"},{"title":"Handlebars.js","description":"Handlebars.js — это клиентский шаблонизатор для JavaScript (однако ничего не мешает использовать его на стороне сервера). Он принимает на вход любую строку, состоящую из HTML-тегов и специальных выражений и компилирует их в функцию JavaScript. Эта функция в свою очередь принимает один параметр — объект данных и возвращает строку HTML, где определенные свойства объекта с данными уже вставлены в нужные места шаблона.","relatedSkills":["HTML"],"type":"technology","link":"http://handlebarsjs.com/"},{"title":"Sass","description":"Sass — модуль, включенный в Haml. Sass — это метаязык на основе CSS, предназначенный для увеличения уровня абстракции CSS кода и упрощения файлов каскадных таблиц стилей. Язык имеет два синтаксиса: SASS и SCSS.","relatedSkills":["CSS"],"type":"technology","link":"https://sass-lang.com/"},{"title":"Less","description":"LESS — это динамический язык стилей, который разработал Alexis Sellier. Он создан под влиянием языка стилей Sass, и, в свою очередь, оказал влияние на его новый синтаксис «SCSS», в котором также использован синтаксис, являющийся расширением СSS.","relatedSkills":["CSS"],"type":"technology","link":"http://lesscss.org/"},{"title":"Stylus","description":"Stylus - это язык препроцессора динамической таблицы стилей, который скомпилирован в каскадные таблицы стилей. Его дизайн зависит от Sass и LESS. Он рассматривается как четвертый наиболее используемый синтаксис препроцессора CSS. Он был создан TJ Holowaychuk, бывшим программистом для Node.js и создателем языка Luna.","relatedSkills":["CSS"],"type":"technology","link":"http://stylus-lang.com/"},{"title":"PostCSS","description":"PostCSS — программа, которая автоматизирует рутинные операции с CSS с помощью расширений, написанных на языке JavaScript. Используется при разработке Википедии, Facebook и GitHub. Один из самых часто загружаемых с npm инструментов для работы с CSS. Разработана Андреем Ситником в компании «Злые марсиане».","relatedSkills":["CSS"],"type":"technology","link":"https://postcss.org/"},{"title":"Bootstrap","description":"Bootstrap — свободный набор инструментов для создания сайтов и веб-приложений. Включает в себя HTML- и CSS-шаблоны оформления для типографики, веб-форм, кнопок, меток, блоков навигации и прочих компонентов веб-интерфейса, включая JavaScript-расширения.","relatedSkills":["CSS"],"type":"technology","link":"https://getbootstrap.com/"},{"title":"Materialize","description":"Materialize – это новый фреймворк, который использует большое количество стилей, элементов, компонентов, анимации и, конечно, принципы Материального дизайна от Google. Есть две доступные версии – Standard, включающий в себя уменьшенные и не уменьшенные файлы CSS и JS, и версия SASS, предоставляющая Вам полную свободу выбора компонентов, которые Вы хотите использовать.","relatedSkills":["CSS"],"type":"technology","link":"https://materializecss.com/"},{"title":"Semantic UI","description":"Semantic UI - это фреймворк создания адаптивных и удобных веб интерфейсов. Данный фраймеворк ускоряет процесс разработки так как содержит в себе большое число часто используемых компонентов таких как: кнопки, иконки, изображения, надписи и т.д.","relatedSkills":["CSS"],"type":"technology","link":"https://semantic-ui.com/"},{"title":"TypeScript","description":"TypeScript — язык программирования, представленный Microsoft в 2012 году и позиционируемый как средство разработки веб-приложений, расширяющее возможности JavaScript. Разработчиком языка TypeScript является Андерс Хейлсберг, создавший ранее Turbo Pascal, Delphi и C#.","relatedSkills":["JavaScript"],"type":"technology","link":"https://www.typescriptlang.org/"},{"title":"Flow","description":"Flow — это статический анализатор кода и набор синтаксических конструкций, для прямого указания типа переменной. Flow умеет вычислять тип переменной, без внесения изменений в код (в отличии от TypeScript) что позволяет начать использовать его уже сейчас в любом проекте. Также есть возможность самостоятельно указывать типы в стиле TypeScript.","relatedSkills":["JavaScript"],"type":"technology","link":"https://flow.org/"},{"title":"jQuery","description":"jQuery — библиотека JavaScript, фокусирующаяся на взаимодействии JavaScript и HTML. Библиотека jQuery помогает легко получать доступ к любому элементу DOM, обращаться к атрибутам и содержимому элементов DOM, манипулировать ими. Также библиотека jQuery предоставляет удобный API для работы с AJAX.","relatedSkills":["JavaScript"],"type":"technology","link":"https://jquery.com/"},{"title":"Angular","description":"Angular - это открытая и свободная платформа для разработки веб-приложений, написанная на языке TypeScript, разрабатываемая командой из компании Google, а также сообществом разработчиков из различных компании. Angular - это полностью переписанный фреймворк от той же команды, который назывался AngularJS.","relatedSkills":["JavaScript"],"type":"technology","link":"https://angular.io/"},{"title":"React","description":"React — JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций. React может использоваться для разработки одностраничных и мобильных приложений.","relatedSkills":["JavaScript"],"type":"technology","link":"https://reactjs.org/"},{"title":"Vue.js","description":"Vue.js — JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк, помогающий разрабатывать продвинутые одностраничные приложения.","relatedSkills":["JavaScript"],"type":"technology","link":"https://vuejs.org/"},{"title":"Ember.js","description":"Ember.js — свободный JavaScript каркас веб-приложений, реализующий MVC шаблон, предназначенный для упрощения создания масштабируемых одностраничных веб-приложений. Фреймворк используется такими компаниями как TED, Yahoo!, Twitch.tv и Groupon.","relatedSkills":["JavaScript"],"type":"technology","link":"https://www.emberjs.com/"},{"title":"npm","description":"npm (Node.js Package Manager)  —  это менеджер пакетов, используемый Node.js-приложениями. В нём вы можете найти массу готовых модулей, поэтому вам не нужно изобретать колесо. Это похоже на Maven для Java или Composer для PHP.","relatedSkills":["JavaScript"],"type":"technology","link":"https://www.npmjs.com/"},{"title":"Yarn","description":"Yarn - менеджер пакетов для javascript, аналог npm, созданный для решения ряда проблем. Особенности: автономный режим; детерминированность; производительность сети; наличие нескольких реестров, в том числе каталог NPM; сетевая гибкость; наличие Flat Mode.","relatedSkills":["JavaScript"],"type":"technology","link":"https://yarnpkg.com/lang/en/"},{"title":"Gulp","description":"Gulp — это таск-менеджер для автоматического выполнения часто используемых задач, написанный на языке программирования JavaScript. Программное обеспечение использует командную строку для запуска задач, определённых в файле Gulpfile. Создан как ответвление от проекта Grunt, чтоб взять из него лучшие практики.","relatedSkills":["JavaScript"],"type":"technology","link":"https://gulpjs.com/"},{"title":"Grunt","description":"Grunt — менеджер задач для автоматического выполнения рутинных операций, написанный на языке программирования JavaScript. Программное обеспечение использует командную строку для запуска задач, определённых в файле Gruntfile. Распространяется через менеджер пакетов NPM под лицензией MIT.","relatedSkills":["JavaScript"],"type":"technology","link":"https://gruntjs.com/"},{"title":"Webpack","description":"Webpack - это модуль с открытым исходным кодом для JavaScript-модулей. Его основная цель - объединить файлы JavaScript для использования в браузере, но он также способен преобразовывать, связывать или упаковывать практически любые ресурсы или активы.","relatedSkills":["JavaScript"],"type":"technology","link":"https://webpack.js.org/"},{"title":"Rollup","description":"Rollup — это инструмент следующего поколение для пакетной обработки JavaScript-модулей. Создайте свое приложение или библиотеку с помощью модулей ES2015, затем объедините их в один файл для эффективного использования в браузерах и Node.js. Это похоже на использование Browserify и webpack.","relatedSkills":["JavaScript"],"type":"technology","link":"https://rollupjs.org/guide/en"},{"title":"Browserify","description":"Browserify - это инструмент JavaScript с открытым исходным кодом, который позволяет разработчикам писать модули стиля Node.js, которые компилируются для использования в браузере. Browserify позволяет использовать запрос в браузере, так же, как вы его используете в узле.","relatedSkills":["JavaScript"],"type":"technology","link":"http://browserify.org/"},{"title":"Jest","description":"Jest был создан в Facebook и представляет собой фреймворк для тестирования кода JavaScript и React-приложений","relatedSkills":["JavaScript"],"type":"technology","link":"https://jestjs.io/"},{"title":"Mocha","description":"Mocha - это тестовая среда JavaScript для программ Node.js с поддержкой браузера, асинхронным тестированием, отчетами об охвате тестирования и использованием любой библиотеки утверждений.","relatedSkills":["JavaScript"],"type":"technology","link":"https://mochajs.org/"},{"title":"Jasmine","description":"Jasmine это BDD фреймворк (Behavior-Driven Development — Разработка на Основе Поведений) для тестирования JavaScript кода, позаимствовавший многие черты из RSpec.","relatedSkills":["JavaScript"],"type":"technology","link":"https://jasmine.github.io/"},{"title":"Английский язык","description":"Английский язык — язык англо-фризской подгруппы западной группы германской ветви индоевропейской языковой семьи. Английский язык — важнейший международный язык, что является следствием колониальной политики Британской империи в XIX веке и мировым влиянием США в XX—XXI веках.","relatedSkills":["Управление персоналом","SEO"],"type":"soft-skills"},{"title":"Базы данных","description":"Базы данных — представленная в объективной форме совокупность самостоятельных материалов, систематизированных таким образом, чтобы эти материалы могли быть найдены и обработаны с помощью электронной вычислительной машины.","relatedSkills":[],"type":"soft-skills"},{"title":"Управление персоналом","description":"Управление персоналом — область знаний и практической деятельности, направленная на обеспечение организации качественным персоналом, способным выполнять возложенные на него трудовые функции, и оптимальное его использование. Управление персоналом является неотъемлемой частью качественных систем управления организации.","relatedSkills":["Английский язык"],"type":"soft-skills"},{"title":"Графический дизайн","description":"Графический дизайн — художественно-проектная деятельность, направленная на создание визуальной графической программы или системы. Графический дизайн поддерживает развитие социально-экономической и культурной сфер жизни, способствуя формированию значимого визуального ландшафта.","relatedSkills":[],"type":"soft-skills"},{"title":"SEO","description":"Поисковая оптимизация (англ. search engine optimization, SEO) — комплекс мер по внутренней и внешней оптимизации для поднятия позиций сайта в результатах выдачи поисковых систем по определённым запросам пользователей, с целью увеличения сетевого трафика (для информационных ресурсов) и потенциальных клиентов (для коммерческих ресурсов) и последующей монетизации (получение дохода) этого трафика.","relatedSkills":["Английский язык"],"type":"soft-skills"}]